// 1)შექმენით ობიექტი რომლის ველებია name, lastname, birthday, age, pn. ყველა ველი უნდა შეიყვანოს მომხმარებელმა.

// let userObj = {
//   name: prompt("შეიყვანეთ მომხმარებლის სახელი"),
//   lastname: prompt("შეიყვანეთ მომხმარებლის გვარი"),
//   birthday: prompt("შეიყვანეთ მომხმარებლის დაბადების თარიღი"),
//   age: prompt("შეიყვანეთ მომხმარებლის ასაკი"),
//   pn: prompt("შეიყვანეთ მომხმარებლის პირადი ნომერი"),
// };

// console.log(userObj);

// 2)მომხმარებელს შეყავს სამკუთხედის გვერდები. შექმენით ობიექტი რომელშიც წერია ამ სამკუთხედის გვერდები მისი ფართობი
// და პერიმეტრი. (თუ სამკუთხედის გვერდებია a,b,c მაშინ მისი პერიმეტრი p = a + b + c;
// ფართობი კი გამოითვლება შემდეგნაირად s =
// √( d(d-a)(d-b)(d-c)) სადაც d არის პერიმეტრის ნახევარი. a, b, c სამკუთხედის გვერდები).

// let a = +prompt("შეიყვანეთ პირველი გვერდის სიგრძე");
// let b = +prompt("შეიყვანეთ მეორე გვერდის სიგრძე");
// let c = +prompt("შეიყვანეთ მესამე გვერდის სიგრძე");

// let p = a + b + c;
// let d = p / 2;

// let triangleInfo = {
//   a,
//   b,
//   c,
//   p,

//   s: Math.sqrt(d * (d - a) * (d - b) * (d - c)),
// };

// console.log(triangleInfo);

// 3)მომხმარებელს შეყავს რიცხვი.შექმენით ობიექტი რომლის key-ები იქნება რიცხვები 1 დან ამ რიცხვის ჩათვლით; value -ები კი ამ რიცხვების კვარდატები.(მაგალითად თუ ფუნქციას გადავცემ 3-ს, უნდა დამიბრუნოს(
// {
//  1:1,
//  2:4,
//  3:9
// } შემდეგი სახი ობიექტი).

// let simpObj = {};
// let number = +prompt("გთხოვთ შეიყვანოთ რიცხვი");

// if (number > 1) {
//   for (let i = 1; i <= number; i++) {
//     simpObj[i] = i * i;
//   }
//   console.log(simpObj);
// }
